import React from "react";
import BlogCard from "./BlogCard";
import BlogHero from "./BlogHero";

// import b1 from "@/public/blog/b1.png";
// import b2 from "@/public/blog/b2.png";
// import b3 from "@/public/blog/b3.png";
// import b4 from "@/public/blog/b4.png";

// import { useRef } from "react";
// import flk from "@/public/hero/flk.png";
// import { motion, useInView } from "framer-motion";
// import Image from "next/image";

const ListBlog = async () => {
  // const dataBlog = [
  //   {
  //     id: 1,
  //     title: "دور الزي الموحد في تحسين مهنة الطهي المنزلي",
  //     mainImg: b1,
  //     description:
  //       "تعتبر مهنة الطهي المنزلي من المهن الشاقة والهامة، وتستحق العاملات في هذا المجال كل التقدير والاحترام. ومن بين الأمور التي تساهم في الارتقاء بهذه المهنة وتوفير بيئة عمل أكثر احترافية، هو اعتماد زي موحد للعاملات. وفي هذا المقال، سنتحدث عن أهمية الزي الموحد للعاملات في مجال الطهي المنزلي، وكيف يساهم مصنع خيال في توفير خيارات متنوعة وعالية الجودة من هذا الزي",
  //   },
  //   {
  //     id: 2,
  //     title: "أهمية زي العمل الموحد في مهنة التنظيف",
  //     mainImg: b2,
  //     description:
  //       "  تعتبر مهنة التنظيف من المهن الشاقة والهامة، وتستحق العاملات في هذا المجال كل التقدير والاحترام. ومن بين الأمور التي تساهم في الارتقاء بهذه المهنة وتوفير بيئة عمل أكثر احترافية، هو اعتماد زي موحد للعاملات. وفي هذا المقال، سنتحدث عن أهمية الزي الموحد للعاملات في مجال التنظيف، وكيف يساهم مصنع ندى في توفير خيارات متنوعة وعالية الجودة من هذا الزي.",
  //   },
  //   {
  //     id: 3,
  //     title: "دور الزي الموحد في تحسين مهنة الطهي المنزلي",
  //     mainImg: b3,
  //     description:
  //       "تعتبر مهنة الطهي المنزلي من المهن الشاقة والهامة، وتستحق العاملات في هذا المجال كل التقدير والاحترام. ومن بين الأمور التي تساهم في الارتقاء بهذه المهنة وتوفير بيئة عمل أكثر احترافية، هو اعتماد زي موحد للعاملات. وفي هذا المقال، سنتحدث عن أهمية الزي الموحد للعاملات في مجال الطهي المنزلي، وكيف يساهم مصنع خيال في توفير خيارات متنوعة وعالية الجودة من هذا الزي.",
  //   },
  //   {
  //     id: 4,
  //     title: "أهمية زي العمل الموحد في مهنة التنظيف",
  //     mainImg: b4,
  //     description:
  //       "  تعتبر مهنة التنظيف من المهن الشاقة والهامة، وتستحق العاملات في هذا المجال كل التقدير والاحترام. ومن بين الأمور التي تساهم في الارتقاء بهذه المهنة وتوفير بيئة عمل أكثر احترافية، هو اعتماد زي موحد للعاملات. وفي هذا المقال، سنتحدث عن أهمية الزي الموحد للعاملات في مجال التنظيف، وكيف يساهم مصنع ندى في توفير خيارات متنوعة وعالية الجودة من هذا الزي.",
  //   },
  // ];

  const res = await fetch(`${process.env.GLOBAL_URL}/api/blog`, {
    method: "GET",
  });
  const DataBlog = await res.json();

  return (
    <div className="">
      <div className=" hidden lg:block w-full ">
        <BlogHero />
      </div>
      {/* blog card  */}
      <div className=" screenPadding flex justify-center items-center flex-wrap gap-6 py-16">
        {DataBlog?.map((elm, ind) => (
          <BlogCard key={ind} data={elm} />
        ))}
      </div>
    </div>
  );
};

export default ListBlog;
